microsoft/uf2-samdx1/lib/samd21/samd21c/atdf/ATSAMD21E15B.atdf
        <module name="TCC" id="U2213" version="1.2.2">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="2" function="F" pad="PA18"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="3" function="F" pad="PA19"/>
              <signal group="WO" index="4" function="F" pad="PA22"/>
              <signal group="WO" index="4" function="F" pad="PA14"/>
              <signal group="WO" index="5" function="F" pad="PA23"/>
              <signal group="WO" index="5" function="F" pad="PA15"/>
              <signal group="WO" index="6" function="F" pad="PA16"/>
              <signal group="WO" index="7" function="F" pad="PA17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="13"/>
              <param name="DTI" value="1"/>
              <param name="EXT" value="31"/>
              <param name="GCLK_ID" value="26"/>
              <param name="MASTER" value="0"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="8"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1"/>
              <param name="TYPE" value="1"/>
              <param name="INSTANCE_ID" value="72"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
              <signal group="WO" index="2" function="F" pad="PA08"/>
              <signal group="WO" index="2" function="F" pad="PA24"/>
              <signal group="WO" index="3" function="F" pad="PA09"/>
              <signal group="WO" index="3" function="F" pad="PA25"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="18"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="24"/>
              <param name="GCLK_ID" value="26"/>
              <param name="MASTER" value="1"/>
              <param name="OTMX" value="0"/>
              <param name="OW_NUM" value="4"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="0"/>
              <param name="TYPE" value="2"/>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x42002800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA16"/>
              <signal group="WO" index="0" function="E" pad="PA00"/>
              <signal group="WO" index="1" function="E" pad="PA17"/>
              <signal group="WO" index="1" function="E" pad="PA01"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DITHERING" value="0"/>
              <param name="DMAC_ID_OVF" value="21"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="27"/>
              <param name="MASTER" value="0"/>
              <param name="OTMX" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PG" value="0"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0"/>
              <param name="TYPE" value="0"/>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
        </module>
        <module name="USB" id="U2222" version="1.0.3">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x41005000"/>
            <signals>
              <signal group="DM" function="G" pad="PA24"/>
              <signal group="DP" function="G" pad="PA25"/>
              <signal group="SOF_1KHZ" function="G" pad="PA23"/>
            </signals>
            <parameters>
              <param name="EPT_NBR" value="8"/>
              <param name="EPT_NUM" value="8"/>
              <param name="GCLK_ID" value="6"/>
              <param name="PIPE_NUM" value="8"/>
              <param name="INSTANCE_ID" value="37"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2203" version="2.0.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40001000"/>
            <parameters>
              <param name="GCLK_ID" value="3"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
      <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
